/*
 * Click nbfs://nbhost/SystemFileSystem/Templates/Licenses/license-default.txt to change this license
 * Click nbfs://nbhost/SystemFileSystem/Templates/Classes/Class.java to edit this template
 */
package ana.andrea.dragonball;

/**
 *
 * @author Ana Carbonell Prieto
 * @author Andrea Pérez Carbonell
 */
public class Mensaje {
    private static final String COLOR_RESET = "\u001B[0m";
    private static final String COLOR_ROIG = "\u001B[31m";
    private static final String COLOR_VIOLETA = "\u001B[35m";
    private static final String COLOR_GROC = "\u001B[33m";
    private static final String COLOR_BLAU = "\u001B[34m";
    private static final String COLOR_CYAN = "\u001B[36m";
    private static final String COLOR_VERD = "\u001B[32m";
    
    public final static String INICIO = """
                                        BENVINGUTS A L’AVENTURA DE DRAGON BALL
                                        ========================================
                                        
                                        Son-Goku es troba tranquil·lament a casa junt al seu fill Son-Gohan, a
                                        qui li està ajudant a resoldre uns deures que li han manat fer a l’escola,
                                        concretament son de matemàtiques. De sobte, apareix a casa el Fullet
                                        Tortuga i els conta que el malvat villà Freezer està planejant trobar les
                                        7 boles del drac per tal de demanar un desig i obtindre un poder que
                                        ningú podrà mai parar. El planeta està en perill. El Fullet Tortuga et
                                        demana ajuda ¿Vols que Son-Goku i Son-Gohan accepten el repte?
                                        """;
             
                                       
    public final static String LVL1 = """
                                      Son Goku: Molt bé! Anem a buscar les boles de drac abans que
                                      Freezer puga tenir-les. --va dir Son-Goku des de la seua casa en el
                                      número %d de Ciutat del Nord.
                                      
                                      Goku va recordar que l’última vegada que les boles van ser repartides
                                      pel món de manera aleatòria, una d’elles va anar a parar a la zona on
                                      actualment viu el seu amic Satanàs Cor Petit i que probablement ell la
                                      tinga en el seu poder. Van marxar doncs cap al número %d de la Ciutat
                                      Meravella, que és on ell viu.
                                      Després d’un llarg camí, hem arribat a la casa de Satanàs i, en efecte,
                                      ell té una de les boles. Però no vol donar-nos-la gratuïtament, ja que li
                                      té molta estima. Ens proposa la següent lluita matemática:
                                      
                                      Satanàs Cor Petit: Sabríeu dir-me quin és el sumatori entre el número
                                      de la vostra casa i el número de la meua? Si l’endevineu, vos donaré
                                      la bola i m’uniré al vostre equip.
                                      """;
                                      
    public final static String LVL2 = """
                                      Satanàs Cor Petit: Sou uns cracks de les matemàtiques! Pensava que
                                      només sabíeu lluitar. Ací teniu la bola de %d estreles. Per cert, tinc el
                                      número de telèfon de Ten Shin Han, qui em va enviar un WhatsApp la
                                      setmana passada per contar-me que havia trobat la bola de %d estreles
                                      en el Desert de l’Oblit. Anem-hi!
                                      
                                      Només arribar, trobaren a Ten Shin Han el qual no tenia el seu millor
                                      dia i no els van rebre amb bona cara. Estava molt cabrejat perquè
                                      estava intentant resoldre un enigma matemàtic i no veia forma de ferho.
                                      
                                      Son Gohan: Hola Ten Shin Han, necessitem que ens dones la teua
                                      bola de drac.
                                      
                                      Ten Shin Han: Sí, un moment, resulta que porte així com 3 hores per
                                      a descrifrar un enigma alfabètic anomenat “La mescla sagrada de
                                      cadenes de text” i no veig la solució. Si m’ajudeu a resoldre’l, vos
                                      donaré la bola. 
                                      """;
    
    public final static String LVL3 = """
                                      Ten Shin Han: Wow! Gràcies, ací teniu la bola de %d estreles. Per cert,
                                      vaig saber que el nostre enemic Boo va trobar una bola de drac en la
                                      seua mudança a “Muntanya Perduda”. Vos guiaré a la cova de la
                                      muntanya on viu. No és lluny d’ací.
                                      
                                      Boo es trobava descansant a la cova. Ja que va tindre molts problemes
                                      en els seus anteriors enfrontaments amb Goku aquest no tenia intenció
                                      de lluitar més amb ell, però al veure’l què anava a per la seua estimada
                                      bola de drac de %d estelles, no va reaccionar amb bones maneres.
                                   
                                      Boo: Què voleu? La meua bola de drac?
                                   
                                      Son Goku: Necessitem reunir-les totes abans que Freezer. El món
                                      corre un gran perill! Sabem que tú ja no vols fer mal al planeta. T’ho
                                      demanem per favor, pel bé de tots.
                                      
                                      Boo: Però és meua! La vaig trobar jo! Encara que pensant-ho millor,
                                      només vos la donaré si em dieu la resposta correcta a la solució de
                                      quin és el factorial de %d.
                                      """;
    
    public final static String LVL4 = """
                                      Boo: Vaja, vos ho he posat realment fácil. Ací teniu la bola. Ara bé, us
                                      avance que encara teniu un os dur de rosegar. Cèl·lula també les
                                      buscava i vaig escoltar en la tele que ja tenia unes quantes recollides.
                                      Si no recorde mal, el vaig sentir a les notícies del canal número %d de
                                      la meua televisió.
                                      
                                      Van sintonitzar el canal %d i van confirmar que Cèl·lula es trobava en
                                      “Ciutat Nova”. Ràpidament van anar a enfrontar-se amb ell i així
                                      aconseguir les boles que tenia en el seu poder.
                                      
                                      Son Gohan: Hola Cèl·lula, no volem problemes amb tu. Per favor,
                                      dona'ns les teues boles de drac i no et farem mal.
                                      
                                      Cèl·lula: Jajaja. He entrenat des de l'última lluita i ara no podreu amb
                                      mi i, per descomptat, no podreu llevar-me les boles del drac que tinc
                                      guardades a aquesta caixa. Juguem a un joc, la caixa té una
                                      contrasenya, però l’única manera d’aconseguir-la és desxifrant
                                      aquesta endevinalla, juguem?
                                      """;
    
    public final static String LVL5 = """
                                      Cèl·lula: Maleïts sigueu! L’heu endevinat, però.... he de confessar-vos
                                      que anava de fanal, i que no tinc cap bola de drac. El que sí puc dir-
                                      vos es que la resta de boles que neccesiteu las té Freezer. Aneu a
                                      molestar-lo a ell. Adèu!
                                      
                                      Son Goku: Bé, anem corrent al planeta de Freezer a llevar-li les boles
                                      que resten. Esperem que surta tot bé.
                                      
                                      Van volar al Planeta Infernal on Freezer esperava al seus contrincants
                                      per a la lluita final.
                                      
                                      Son Goku: Hola Freezer, sabem què trames. No ho permetrem.
                                      Dona'ns les boles de drac %d, %d, %d i %d que sabem que tens.
                                      
                                      Freezer: De cap manera! Doneu-me vosaltres les vostres. Però mireu,
                                      com no vull lluitar perquè ja tinc una edat, us done la possibilitat de
                                      resoldre aquest conflicte amb una lluita matemàtica. Si sabeu dir-me
                                      quin és el mínim comú múltiple de %d, %d, %d i %d tot haurà acabat.
                                      """;
    
    // MÉTODOS IMPRESIONES

    public static void asciiArtInicioJuego() {
         System.out.println("  __\n" +
"  |  \"\"--.--.._                                             __..    ,--.\n" +
"  |       `.   \"-.'\"\"\\_...-----..._   ,--. .--..-----.._.\"\"|   |   /   /\n" +
"  |_   _    \\__   ).  \\           _/_ |   \\|  ||  ..    >  `.  |  /   /\n" +
"    | | `.   ._)  /|\\  \\ .-\"\"\"\":-\"   \"-.   `  ||  |.'  ,'`. |  |_/_  /\n" +
"    | |_.'   |   / \"\"`  \\  ===/  ..|..  \\     ||      < \"\"  `.  \"  |/__\n" +
"    `.      .    \\ ,--   \\-..-\\   /\"\\   /     ||  |>   )--   |    /    |\n" +
"     |__..-'__||__\\   |___\\ __.:-.._..-'_|\\___||____..-/  |__|--\"\"____/");
    }
    public static void ascciArtFullet(){
        System.out.println("   #=----+%                                  \n" +
"                %##***%             *-:.:::::::::=*                               \n" +
"               %##*+++###         +:...::::::::::-==*                             \n" +
"               ##*+++++*#%       -.:::::::::::::::===+%                           \n" +
"              %*++++++**##      -.:::::--::-::-=-:-===+                           \n" +
"              #+++++**+###     -.:::::::::=::-::::-====*                          \n" +
"              %*++*##+*##%     :::-::::-:::-:::-::-=====@                         \n" +
"              #+***#**###     *.:::----::::::::---:-====*                         \n" +
"              ***+++*####%    =::-..:==+-:::::+=====:+==+                         \n" +
"              ***++*###### #*==:=..-:::--::::-:::::==:==+=+#%                     \n" +
"              %###***####*=+=+-:=--::::::::::::::::-=+==****+++%                  \n" +
"               %#*++*####*+*#*=::::::::::::::::::::=====#******++*                \n" +
"               ###**+#####*+.-+=###%%%%%+-::-=#%#%%%%#**#*##****+++*              \n" +
"                %#*++**###@-+=*#@##@@@@@@###%@%##@@@@@%%+--#*##****++#            \n" +
"               #*###***##++-:==#%##%@@@@@%==%@%##%@@@@%=+--+*####****=#           \n" +
"              *++*#######*#*:-=*###%@@@@@*--#@%###@@@@#+=:=+*###******=*          \n" +
"             *=+*#==####%##--:-=*##%%@@%*:-:=%%###@@%**+---**+===******+%         \n" +
"            *=+#*==*######=-+=:-::::-:::::-:-=-+**+===*-=+=======**=+#**=#        \n" +
"           %+*+**=%*##*##+-++%+:=::::::==:::-+=:::-=+=-+%+*-=====#+===+**+        \n" +
"          #=+=====+@@#*##==*#@@@#+::::*...-:-..+::==+*++%@#+=====@@%===+*+%       \n" +
"          +++#====+*%%**#+++%*=**+=:-.....:-.....==+++*#%*+=--===++====***+@      \n" +
"          %@@+===++++***#*++#+===+*-..............:*++++***==-==++*=+=+*****      \n" +
"         *=%#+#*+*####***#====+==+.......-==:.......+++++*****-=++*+++****#*      \n" +
"        #++@@%*##%####*++*===**+=:.....:=+++=-.......*+==+***+*-++**+**+===*@     \n" +
"       @======+++*###::::::-***=+....--=+---=+=::....=+===**+=++==+*+===@*=+#     \n" +
"       +=*+=+**+++++:::=---==**=+...--+-:..::-=+--::.*====+*++**++-++===+%==#     \n" +
"      %###---====++=::::::--+++==::-==-:.....:-=++---====*%*#=+*+++***===%#+*%    \n" +
"      %##+::::-==+#=::::-:::++=**-==*+-......:-=+++-=+===+%#*++++++*++++#+==*%    \n" +
"        *:::::-==##+:-::::==***%++++++-:.....:==+++-======+=+%+++++*+++===+#*@    \n" +
"        +:::::-=*##=:-::::::+=@@%=++=++-..:---=+++=+*=====+%#==++++***++@#**#     \n" +
"        -::::-==-:::::::--=+=+@#@**+++++=.--===++==+===========++++*=-:-@#**#     \n" +
"        -::-:.::::::---=**#*=+@+*%****+.:---=+==+*#=#*=========+++*#+-::#####     \n" +
"        -::::::::--=+==++*##====+****+---=+-+=-:%++@#****++====++*##*=::.***#     \n" +
"        -:::::-===*#*@%***##====+***+=*-==+*==-=%##@==******===+##***=:::=##%     \n" +
"        =:::-===*@#+*%%***##**===**+=##=------+++====-****%#==*++++++=::::#*@     \n" +
"        #-:-=*%@@+%#%%**#**#=====*+=*#=+==+*+*========****%@%@%+++++++:::.*#      \n" +
"        %+=+*#@@@+==*******#+==*%++====+=+===+=======++*+#++=#*+++++++:::.=#      \n" +
"         #==**%@@*==++===**##=##@+=*===++====+========+*=====%+++++++=:::.=#      \n" +
"          +=+*#@@+=======***##@#@*==+*+++====+=======+=====+++++=+++++-::.+%      \n" +
"          %*+**#+=%======+**#*==%*===++++=====+====+====+**=====%%@#++=-:.#       \n" +
"           %=+**=%+==@+*==**#+=========++=====+====+******=====*@#%+++=-:.#       \n" +
"            *=+=*%=+#%=***+##*=======+*##========*******+=======+++*+##=::+       \n" +
"             #+=+===#*=+***##+======+*###*========#@%#*=========+**###%+-:-#      \n" +
"              ==========#**##=====+##++##+========%**@==========++*####=:::-#     \n" +
"                =:======#***#*===*%=%#*#*+========*%%@@%%#====+++=-=*++=:::::%    \n" +
"               =:....:-.=*+#*+===#@@@#+++======+====++--=+=::-----=+*=++:::-:=    \n" +
"                 *===-=..#**+--+===++*#*@@+==+=----.....:==-======+#*-=-:::-:=    \n" +
"                +:::-====****------=+**%@@@@@@=...=*#@@@@%=-:..::-=+@+--=-.-+     \n" +
"                -:::::-==+*+#*%%*=--%@@@@@@@@@@@@@@@@@@%#**=:..:::-=* @*:=        \n" +
"               +.::::-==++*+*##*#@@@@@@@@@@@@@@@@@@@@%****+==:.::::=+             \n" +
"               =.::::===+@#*+*=+**#@@@@@@@@@@@@@@@@##***+==+%+:.:::-=#            \n" +
"               +:.:=======#*+*+==+***%@@@@@@@@@@@#***++==*#+-::::-:-=*            \n" +
"                 *::=-=====***%#+===***#%@@@@@%#***++=+*% *::.:::--=*             \n" +
"                  %::::-===+**#   *+==+***#%%*#**+==+%   *-:.:::-==#              \n" +
"                    =.:::-==+**%    %+===+****+===*      =:.:::-=+%               \n" +
"                     *::::-==**#       @*==+===#        +:.:::-=*                 \n" +
"                       =:::-=+**           %*#          :.::-=*                   \n" +
"                        *:::-=**#                      =.::-=#                    \n" +
"                         *:::-*#*                     =.::-+                      \n" +
"                          #:::=#*+**                *=.::=+                       \n" +
"                        *::::::##+==+              -.-:::=*                       \n" +
"                    **-:::::::-*#+==#%@          *:::::::::::::-*%                \n" +
"                 %=*+::::::::-=+#*%%%#*         @=::::::::::::::=*-:-=            \n" +
"                *::++:-=+****+*%#*#***#       #%%%#==-=-:-+##++++++-==+%          \n" +
"               #=-::++-:::-+%#%##*#+*#        %***###%%%%#%#+=:--::---*#+         \n" +
"              %%+++=======#%%*+*+#*@           #++++***+====+*##%##%#*==*         \n" +
"              #+#%%*+=+##++**+#% #+#              ###*+++++++==========+%         \n" +
"               #++====++*+**%    %*#                       @%%##****#             \n" +
"                 %*++*#%          %%     ");
    }
    public static void asciiArtGoku() {
        System.out.println("Son Goku");
        System.out.println("              ___     -._\n" +
"            `-. \"\"\"--._ `-.\n" +
"               `.      \"-. `.\n" +
" _____           `.       `. \\        \n" +
"`-.   \"\"\"---.._    \\        `.\\\n" +
"   `-.         \"-.  \\         `\\\n" +
"      `.          `-.\\          \\_.-\"\"\"\"\"\"\"\"--._\n" +
"        `.           `                          \"-.\n" +
"          `.                                       `.    __....-------...\n" +
"--..._      \\                                       `--\"\"\"\"\"\"\"\"\"\"\"---..._\n" +
"__...._\"_-.. \\                       _,                             _..-\"\"\n" +
"`-.      \"\"\"--`           /       ,-'/|     ,                   _.-\"\n" +
"   `-.                 , /|     ,'  / |   ,'|    ,|        _..-\"\n" +
"      `.              /|| |    /   / |  ,'  |  ,' /        ----\"\"\"\"\"\"\"\"\"_`-\n" +
"        `.            ( \\  \\      |  | /   | ,'  //                 _.-\"\n" +
"          `.        .'-\\/'\"\"\\ |  '  | /  .-/'\"`\\' //            _.-\"\n" +
"    /'`.____`-.  ,'\"\\  ''''?-.V`.   |/ .'..-P''''  /\"`.     _.-\"\n" +
"   '(   `.-._\"\"  ||(?|    /'   >.\\  ' /.<   `\\    |P)||_..-\"___.....---\n" +
"     `.   `. \"-._ \\ ('   |     `8      8'     |   `) /\"\"\"\"\"    _\".\"\"\n" +
"       `.   `.   `.`.b|   `.__            __.'   |d.'  __...--\"\"\n" +
"         `.   `.   \".`-  .---      ,-.     ---.  -'.-\"\"\n" +
"           `.   `.   \"\"|      -._      _.-      |\"\"\n" +
"             `.  .-\"`.  `.       `\"\"\"\"'       ,'\n" +
"               `/     `.. \"\"--..__    __..--\"\"\n" +
"                `.      /7.--|    \"\"\"\"    |--.__\n" +
"                  ..--\"| (  /'            `\\  ` \"\"--..\n" +
"               .-\"      \\\\  |\"\"--.    .--\"\"|          \"-.\n" +
"              <.         \\\\  `.    -.    ,'       ,'     >\n" +
"             (P'`.        `%,  `.      ,'        /,' .-\"'?)\n" +
"             P    `. \\      `%,  `.  ,'         /' .'     \\\n" +
"            | --\"  _\\||       `%,  `'          /.-'   .    )\n" +
"            |       `-.\"\"--..   `%..--\"\"\"\\\\\"--.'       \"-  |\n" +
" _----_     \\          `.  .--\"\"\"  \"\\.\\.\\ \\\\.'       )     |");
    }

    public static void asciiArtBOO() {
         System.out.println("BOO");
        System.out.println("  ...                              ..            \n" +
"                                  .   .                          ..:...           \n" +
"                                  .   :.                        ....:;:.          \n" +
"                                      ..                      ....::..:.          \n" +
"                                      ..  .                  ::.....::            \n" +
"                                    ...:                   . . .:.::              \n" +
"                                   ..         .      ;::;.     .::.               \n" +
"                                  ...   .....  .:::;;:;.   ....                   \n" +
"                                 .....     .    :;:+:;     ..                     \n" +
"                                :+;:.           :;;;:;. ..:.                      \n" +
"                            :;;++;+:.          :;:;;+&$;;++:                      \n" +
"                          ;++++++++;;:..   ..;++;;:+XX$&X++;                      \n" +
"                        :;++++++;;;+;;+;;+;;::;:;x&$XXX$&X+;:                     \n" +
"                        ++xx+++++++++++;;;;;+;;:+$&$XXXX&$x;:                     \n" +
"                      .++++X$$$X$$;;++:::   ;;;::X&&$XXXx:;;::                    \n" +
"                       ;:.:$&&&&&&$++;. ..::. .:;+&&$XX:: :;:::                   \n" +
"                       ...:+&&$XXXXX+;         .:x$+;:.   :+::::::                \n" +
"                      ..:::::;xXXXXx;;          ..        ;;;:::::::.             \n" +
"                   .:....:;;.. ..... ..                  ;.:+::::;;;:::           \n" +
"                  .::::::  .X.                         :x.  . ::::;++;;;:         \n" +
"                 .::::.       ;:                    :+:        .:::;              \n" +
"                :::::.          +Xx:           .+XX+             ::.              \n" +
"          :;;++x::::.              ;xX:..:.:..:Xx.               :.               \n" +
"         ;;+xx;;;;;;:. +$&$X          ..;.:.:.:         ;xx:   .                  \n" +
"        ;;+xx+;;;;;;......X&X            ...          :$&&X+;...:;;;;;:           \n" +
"       .;;   .+;;;;;;.....:$x                         :&$:.....;;;;;;;.           \n" +
"        ..     ;;;;;;:....::.                          ;::.:..;+;;;;;.            \n" +
"                 ;+++;;..:::                        .:..:::.;;+++;;:              \n" +
"                   ;;;;::;.   .     .                  .:+;;;;;;;.                \n" +
"                    ;;;:                                  :;;;;.                  ");
    }

    public static void asciiArtTenShinAn() {
        System.out.println("Ten Shin Han");
        System.out.println(" .::-:::                                       \n" +
"       .=====-..                                     \n" +
"       .-====--.                                     \n" +
"       .--====-.                                     \n" +
"        .-=====:.                                    \n" +
"      .::-=====-:                                    \n" +
"   .-:-==-==-==::.              ..                   \n" +
"   .==+===+::.:::--:.::-.    .-::::::..              \n" +
"   .+==+===:.::--:===++... .--:-=:::::.              \n" +
"   ..==+*++==-==-===:-===:.:--::+-::=:               \n" +
"     .:*+-.:=-::==**:-:-=--::-.:-++*+..              \n" +
"      .:+=--+::-=+##+:::-*+:=+:*+=+...               \n" +
"       ..:=#%%##%###-=--+-.-:::=*:..                 \n" +
"         ..*%%%%%%#=-+=*=:.::-=::=-:.                \n" +
"          ..-==*++==**+++=:::::::--.:=..             \n" +
"            ..=+=*==-::==:-++++=-==:::=..            \n" +
"                ..-=====:::-==---::==-=:             \n" +
"                 ..:==-::=:::-:::=:=-*+-.            \n" +
"                    .+-:----=*++=+:=+-..  ....::.    \n" +
"                    ..+%%%###%%%%%%%*+=:.::=-+-=.    \n" +
"                      =%%%%###%%%%#%%###*-=+==-:..   \n" +
"                      -*##**#*##*%##%%%%%++-=+=:.    \n" +
"                    ..+##*******#%#*#=..........     \n" +
"                 ...-#**##***#*##%####...            \n" +
"                ..-##***#**#***#%%####%%+:..         \n" +
"              ..-*****+*****#**#%%%######%#%*-..     \n" +
"             ..=*******+**#*#*#%%###*******#####=..  \n" +
"            .-************#*%%%@%##***********#####: \n" +
"          ..+***#*****+**%##%#-.+#***#%%###********#-\n" +
"         .-#***%#*+***#*%%##..  ....+%#*************%\n" +
"       ..:*%*#*%#****#*#@#...        .-##%%%%%%**#*%+\n" +
"       .:***##*%###%%***.             .:%#****#%%###.\n" +
"      .+#####%%%%%****#.               .+%%%#***%%##:\n" +
"      .##*#%%##%#**#%%:                 :*##%%%##*...\n" +
"      .=#******###%%%:.                .=+++**+=.    \n" +
"     .:-###%%%@%%####..               .:+=-=+**:.    \n" +
"    ..-::**++*###-..                  .-#%%##%@@:.   \n" +
"   ..=-::==*==+:.                        .-*%##+@%.  \n" +
"   .++=:===++-.                             .-*#=%@=.\n" +
"  .-*+*****=.                                        \n" +
" .=##%#++*-.                                         \n" +
".=*%%@@@=..                                          \n" +
"+##%@@@-.                                            \n" +
"*#%@@@:                                              \n" +
"%@@=.. ");
    }

    public static void asciiArtCel() {
        System.out.println("Cèl·lula");
        System.out.println("                                            \n" +
"                   #%%        +*                             \n" +
"                   #@#      **++                             \n" +
"                   *@%#    **+**                             \n" +
"                   *@%%####+*++                              \n" +
"                   *%+*%%#*+*=+                              \n" +
"                   *#####*+*++@                              \n" +
"                   +*%%%#***++                               \n" +
"                   **#%#*=+**#@                              \n" +
"                    %*+=+*++*##                              \n" +
"                     +==*+-++++###                           \n" +
"                @@@%%***+**#*#%%@%*                          \n" +
"               %%%#%@%%@@@%%+#%###**                         \n" +
"              #**+###*#####+=*%@*%+=                         \n" +
"              +=+++#@@@#*##%%*#%#*=#                         \n" +
"             =+##*##%%#*#*%###+###@%%                        \n" +
"            +=*###*#**#%##*+++@@@@@@#%                       \n" +
"           #+=*%%%+*%%###*=+@@@@@@@@@#%                      \n" +
"             -=*#%@@@@@%###%@@@@@@@@@@%%                     \n" +
"              *+**+#%%#*+**+%@@@@@@@@@@#%                    \n" +
"              %@@*#%%%%#*#*+**+=+@%%%@@@#%                   \n" +
"             %%=**#@@@****#*#++=@%%%%%@@@#                   \n" +
"             %%++#+%@%**####++=%@%%%%%%@@%%                  \n" +
"             %@@*+####++##%%#+*@%%%%##%%@@%%                 \n" +
"             %@@%*+**#+=*%%%%#+%%%%####%%@@%%                \n" +
"            %%@%##%@%**+=#%@%#+#%%%#####%%@@%%               \n" +
"            #%%%%#%%#*##=#%%@*+##%#######%%@%#               \n" +
"           %#%%%%#%%%**%=+@%%*++%#%#######%%@%%              \n" +
"           %%%%###+%*+##++***#+*  #%#######%%@%%             \n" +
"           #%%####=+=+##+*=+*+++   %%%######%@%%             \n" +
"           #%%#####*++*#*-*#%#*+#    #%######%@%%            \n" +
"           %%####%***#@%*#%+*#*##     #%#####%%%#            \n" +
"           %%##%%####%%#**#%%%%#*       #%####%@#%           \n" +
"           %%#%% *#%@@@#*+#%%%@@#*        #%###%%#           \n" +
"          %%%%%  *%%@@@%*+#@%%%@%#         %%%%%@%%          \n" +
"          %%%    ##%@@@%*+#@%%@@@*#           %%@%%          \n" +
"                  %%@%%#++#%%%@@%*#              %%          \n" +
"                  %%@%#++ **#%@@#++                          \n" +
"                  #%@%#+#  *#%%@%**                          \n" +
"                  #%%%#=%   +%%@%**                          \n" +
"                 ##%%%#=+   ##%@%#+                          \n" +
"                *##%%%#*+    *%%%%+*                         \n" +
"                **##****%   #*%%###+*                        \n" +
"              +=**+===+=    +++*##**+                        \n" +
"             ++=--===       +++=###+=                        \n" +
"            +=+              *=-=*#+=                        \n" +
"                               --=*+=                        \n" +
"                                +---=                        \n" +
"                                   ++    ");
    }
    
    public static void asciiArtSonGohan(){
        System.out.println("Son Gohan");
        System.out.println("  __...__\n" +
"          \"-._  \"\"--.._     \\-.\n" +
"              \"-.      \"-.   \\ `.\n" +
"                 \\        `. |   \\\n" +
"                  |   \\  \\  \\`|   \\   _.---..__\n" +
" -..\"\"\"\"\"\"\"---..  |          \\|   |,-\" __   __..\"--\n" +
"    \"\"--._      \"\"-|   | |  \\ |   `_.-\"  \"\"--._\n" +
"         _`-.       `.         _.-\"         ___.\"-\n" +
"       \"-.\"\"-`. `.    `.     -\" _-\"  ,' .-\"\"__\n" +
"           \"-. \\  \\     _.._        / ,'     _\"-\n" +
"          _.----\\           `.       /  =._   `\\\\\n" +
"        ,/ _.--   /    \\,-.   \\\"\"-.     -._  :.\\\n" +
"       /  __... / |   /\"   `. |   )          _)\\\n" +
"      /-\"\"  /  (   `.|   ./ _\\|  ',-\"\"\\  _.-\"\n" +
"           | .-/\\ /|\"6=.,.=6\"/`    ,9 |-\"     \n" +
"           '  '\" \\|`(--')`--'      /',\\\n" +
"                  `  \\\"/_ \"\"\"    _.-'  \\       \n" +
"                      . .--     /\\      \\         \n" +
"                       `.\"   .-   |      \\\n" +
"                         \"--\"    /       |\"-.----._\n" +
"                   ,-.---,|    ,'   ______   `.    `--..__\n" +
"               .-\"/   .'' |   .--\"\"\"      \"\"-.|           `--.\n" +
"              /     /' \"-. _.'                |      _.--\"\"\"`-.\n" +
"             /    ./      /         --\"\"\"\"\",/'     ,'        \\ \\\n" +
"           /'|/   (      |             ,/'        /           \\ \\\n" +
"          /  /    `\\     |          ,/'          /            |  )\n" +
"          | /       `._.- ---..__,/'            ( \\          /   /\n" +
"           (          `.      ,/'                `.`-..__    `--._\n" +
"          / `.          `\\_,/'                     \\      \"`\\     \\");
    }
    
    public static void asciiArtFreezer(){
        System.out.println("Freezer");
        System.out.println("                                                    \n" +
"                              @#*##%@@                                        \n" +
"                           @*+++###%%%%%@                                     \n" +
"                          %+++####%%%%+-=#                                    \n" +
"                         %+++####%%%+----=                                    \n" +
"                         #++####%%%=-----=#                                   \n" +
"                         +*####%%%=-----=*                                    \n" +
"                         #-=*##*+-------=##                                   \n" +
"                          %=----=--=*-=-=#%                                   \n" +
"                           %##+=++**=-+#                                      \n" +
"                             #-+==*-=+++*#                                    \n" +
"                           %#@%*+==*+++++=+#*++*%                             \n" +
"                         %#*----+-=*+=--==-+%%###%                            \n" +
"                        @#--+---==------==---*%%%%@                           \n" +
"                        %-+-----=---------=**++===%                           \n" +
"                        %==----=+------=+++*-----+-*                          \n" +
"                       #-=-=#**##%%%%+++++++*-----=-+                         \n" +
"              #        *-=+-++*####%+-----++##=+==+==+@                       \n" +
"              +=%   @+==++++-*+###%+---=+++#   #*==+---=@    @                \n" +
"             @+---+=-----*++---*+------+#@      *==-----+   ==                \n" +
"          *=++-====*----=++#+--+----=--+%        %-------+=-=#                \n" +
"            #=-----=+++**#  #=-----=--=@          %*++-+=====#                \n" +
"           *=# %=+-#       @=--------=--+-----==++++*##-----===+              \n" +
"               +* *+       #-------==----*=-----------===-=-* @+=             \n" +
"                           ==------------=*==-------=+===+-+=%                \n" +
"                           =+=----=-------++*+++++++++++=+++*=-#              \n" +
"                          %--++---=------=***++++++++++++++++++=+             \n" +
"                          %-=-+*+*------+-%@@@@@%%##+++++++++*+++*            \n" +
"                           ==-=++-------=-#           %#++++++++++#           \n" +
"                           *+*=++-=-------#             @*+++++++++#          \n" +
"                            +++++-=------=#               #++++++++#          \n" +
"                            #++++--------#                 *+++++++#          \n" +
"                             %**-------=#                  #+++++++#          \n" +
"                            @*+*------++---=+%            @+++++++*@          \n" +
"                         @*====++=-=-=++===----+@        %++++++++@           \n" +
"                       %+=+++****--==-+#*++++=---+#    %*++++++++#            \n" +
"                      *+++*@    +++*-=-+*+#++++++=----=++++++++*@             \n" +
"                     #++*      @=++=---=*+*@@+++++++++++++*+++%               \n" +
"                     #*+%     *------+=+#++@  @*++++++++++++%                 \n" +
"                     @++*     #++++---=+#++@     @%#***#%                     \n" +
"                       %*+%   #**##---=+*++@                                  \n" +
"                              #**##+--=*+++#                                  \n" +
"                              #**##---*%#++%                                  \n" +
"                              @###*--+%%%*+++#                                \n" +
"                              @###+-=#+++++++++@                              \n" +
"                              %##%+-=#++#@  %#%%                              \n" +
"                              %#%%=-=#*@                                      \n" +
"                           %+=-=++++*                                         \n" +
"                       @%#---==+---==*                                        \n" +
"                         @@@ #---===--*                                       \n" +
"                            *===*   +-+@                                      \n" +
"                           +--=#      #+                                      \n" +
"                          @*+%     ");
    }
    
    public static void asciiArtSatanas(){
         System.out.println("Satanàs Cor Petit");
        System.out.println("                             ____\n" +
"                          .-\"\"    \"\"--.\n" +
"                        ,'             `.\n" +
"                       /     ,'          \\\n" +
"                    `\\/     .             |\n" +
"                  .===:_,  |              /\n" +
"                 / .'\"\"\".  ,:=:.         / _.,\n" +
"                \"   `--. `|/  _\\` (    _/-\" /\n" +
"                     |\\_b_9-\"\"  ___) -\"-\"//'\n" +
"                     | --/`--_o\"_/'  (6_//\n" +
"                     / ,'    -\"\"    .),-'\n" +
"                     (  \"-__       `-(\n" +
"                      \\ |HHH/    /    \\\n" +
"                       \\  -   _./      `-._..._\n" +
"                        7----\",'/     ..-\" .-- \"--.._\n" +
"                 _.._.-/)  .-',/   .-\"  -\"           \"\"--..\n" +
"          _..--\"|=\"\"--..--\"\"\"\"\"\"./'  .              .-\"\"\"-.\\\n" +
"        ,' .-','     ,'       /.   /              .'       \\\\\n" +
"     .:' ,' ,:      /      ,/'/  /'         _....' _..--\"\"\" )\n" +
"   ,\"/  /  /(      /   _,/' / ,/'         /.    .-\"       __|\n" +
"  / / /'  (  \"\"----\"\"\"\"   / ,/           / `:.-\"    _.--\"\"  /\n" +
"  ||  (    \\_       __.-'  /             |`-.`:=._-\"    _.-:|\n" +
"  \\/   \\     \"\"\"\"\"\"\"      /               \"\"-`  `-\"====\"-'   \\\n" +
"  |     \"-.        __..-\"                    \\._.====..       `\n" +
"  |        \"\"--\"\"\"\"                          //..---\"\"\\\\       .\n" +
"  \\                           _----_       /'| __...---.\\      |");
    }
    
    
     public static void asciiArtFin(){
         System.out.println("ASCII FIN");
        System.out.println(" ______________ ______________  ___________ _______  ________   \n" +
"\\__    ___/   |   \\_   _____/  \\_   _____/ \\      \\ \\______ \\  \n" +
"  |    | /    ~    \\    __)_    |    __)_  /   |   \\ |    |  \\ \n" +
"  |    | \\    Y    /        \\   |        \\/    |    \\|    `   \\\n" +
"  |____|  \\___|_  /_______  /  /_______  /\\____|__  /_______  /\n" +
"                \\/        \\/           \\/         \\/        \\/ ");
    }
    
    public static void asciiArtPerdut(){
         System.out.println("ASCII PERDIDO");
        System.out.println("       ___           ___           ___           ___     \n" +
"     /  /\\         /  /\\         /__/\\         /  /\\    \n" +
"    /  /:/_       /  /::\\       |  |::\\       /  /:/_   \n" +
"   /  /:/ /\\     /  /:/\\:\\      |  |:|:\\     /  /:/ /\\  \n" +
"  /  /:/_/::\\   /  /:/~/::\\   __|__|:|\\:\\   /  /:/ /:/_ \n" +
" /__/:/__\\/\\:\\ /__/:/ /:/\\:\\ /__/::::| \\:\\ /__/:/ /:/ /\\\n" +
" \\  \\:\\ /~~/:/ \\  \\:\\/:/__\\/ \\  \\:\\~~\\__\\/ \\  \\:\\/:/ /:/\n" +
"  \\  \\:\\  /:/   \\  \\::/       \\  \\:\\        \\  \\::/ /:/ \n" +
"   \\  \\:\\/:/     \\  \\:\\        \\  \\:\\        \\  \\:\\/:/  \n" +
"    \\  \\::/       \\  \\:\\        \\  \\:\\        \\  \\::/   \n" +
"     \\__\\/         \\__\\/         \\__\\/         \\__\\/    \n" +
"      ___                        ___           ___      \n" +
"     /  /\\          ___         /  /\\         /  /\\     \n" +
"    /  /::\\        /__/\\       /  /:/_       /  /::\\    \n" +
"   /  /:/\\:\\       \\  \\:\\     /  /:/ /\\     /  /:/\\:\\   \n" +
"  /  /:/  \\:\\       \\  \\:\\   /  /:/ /:/_   /  /:/~/:/   \n" +
" /__/:/ \\__\\:\\  ___  \\__\\:\\ /__/:/ /:/ /\\ /__/:/ /:/___ \n" +
" \\  \\:\\ /  /:/ /__/\\ |  |:| \\  \\:\\/:/ /:/ \\  \\:\\/:::::/ \n" +
"  \\  \\:\\  /:/  \\  \\:\\|  |:|  \\  \\::/ /:/   \\  \\::/~~~~  \n" +
"   \\  \\:\\/:/    \\  \\:\\__|:|   \\  \\:\\/:/     \\  \\:\\      \n" +
"    \\  \\::/      \\__\\::::/     \\  \\::/       \\  \\:\\     \n" +
"     \\__\\/           ~~~~       \\__\\/         \\__\\/     ");
    }
}
